class 早餐店 :
	def __init__(self) :
		self.菜單={
			"火腿蛋吐司":{
				"價格":25,
				"選項":["加辣","不加洋蔥","不加龍蝦"],
				"說明":"有吐司有蛋的火腿"
			},
			"玉米蛋餅":{
				"價格":15,
				"選項":["不加玉米","不加蛋","不加餅"],
				"說明":["用餅把玉米的蛋包起來"]
			},
			"豆漿":{
				"價格":10,
				"選項":["八倍糖","不糖","加辣","不要大蒜"],
				"說明":["把豆子打到流湯，在收集起來的珍貴液體"]
			}
		}
		self.訂單=[]

	def 增加 (self, 名稱, 數量) :
		選項=[]
		for 候選 in self.菜單[名稱]["選項"] :
			if input("輸入 y 加註 %s :" % (候選)) == 'y' :
				選項.append(候選)
		self.訂單.append({"名稱":名稱,"數量":數量,"選項":選項})

	def 試算 (self) :
		print("========================================================")
		總價=0
		for 餐點 in self.訂單 :
			單價=self.菜單[餐點["名稱"]]["價格"]
			價格=單價*餐點["數量"]
			print("{2:3d}x{1:3d}={3:5d} {0:s} {4}".format(餐點["名稱"],餐點["數量"],單價,價格,",".join(餐點["選項"])))
		總價+=價格
		print("總價={0:6d}，含稅={1:6d}".format(總價,int(0.5+總價*1.05)))

美而美 = 早餐店()

#@param ["豆漿","火腿蛋吐司","玉米蛋餅"]
餐點名稱 = "豆漿"
#@param {type:"slider", min:0, max:10, step:1}
餐點數量 = 1
美而美.增加(餐點名稱, 餐點數量)
美而美.試算()
