class 早餐店 :
	"""
	美而美 = 早餐店()
	餐點名稱 = "豆漿" #@param ["豆漿","火腿蛋吐司","玉米蛋餅"]
	餐點數量 = 1 #@param {type:"slider", min:0, max:10, step:1}
	美而美.增加(餐點名稱, 餐點數量)
	美而美.試算()
	"""
	def __init__(self) :
		self.菜單={
			"火腿蛋吐司":{
				"價格":25,
				"選項":["加辣","不加洋蔥","不加龍蝦"],
				"說明":"有吐司有蛋的火腿"
			},
			"玉米蛋餅":{
				"價格":15,
				"選項":["不加玉米","不加蛋","不加餅"],
				"說明":["用餅把玉米的蛋包起來"]
			},
			"豆漿":{
				"價格":10,
				"選項":["八倍糖","不糖","加辣","不要大蒜"],
				"說明":["把豆子打到流湯，在收集起來的珍貴液體"]
			}
		}

	def 試算 (self, 訂單) :
		總價=0
		for 餐點 in 訂單 :
			單價=self.菜單[餐點["名稱"]]["價格"]
			價格=單價*餐點["數量"]
			print("{2:3d}x{1:3d}={3:5d} {0:s} {4}".format(餐點["名稱"],餐點["數量"],單價,價格,",".join(餐點["選項"])))
			總價 += 價格
		含稅 = int(0.5+總價*1.05)
		print("總價={0:6d}，含稅={1:6d}".format(總價,含稅))
		return {"總價":總價,"含稅":含稅}
